In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
 dates = pd.date_range('20130101', periods=6)

In [4]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [5]:
df

                   A         B         C         D
2013-01-01  0.163832  0.050099  0.586754  0.726021
2013-01-02  0.722502 -0.933674  0.975281  0.637302
2013-01-03 -0.836480 -0.604213  0.869385  0.361669
2013-01-04 -1.141631  0.738676  1.234711 -1.646007
2013-01-05  0.302094  0.257563  0.857477  0.410819
2013-01-06  0.334431  0.003042  1.369239 -0.104218

In [6]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [8]:
df.iat[0, 1] = 0

In [9]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [10]:
df.mean()#FIND OUT MEAN OF

A   -0.075875
B   -0.089768
C    0.982141
D    5.000000
dtype: float64

In [11]:
# Same operation on the other axis:

In [12]:
df.mean(1)

2013-01-01    1.437647
2013-01-02    1.441027
2013-01-03    1.107173
2013-01-04    1.457939
2013-01-05    1.604284
2013-01-06    1.676678
Freq: D, dtype: float64

In [13]:
 s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates)

In [14]:
s

2013-01-01    1.0
2013-01-02    3.0
2013-01-03    5.0
2013-01-04    NaN
2013-01-05    6.0
2013-01-06    8.0
Freq: D, dtype: float64

In [15]:
s.shift(2)

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [16]:
df.sub(s,axis='index')

                   A         B         C    D
2013-01-01 -0.836168 -1.000000 -0.413246  4.0
2013-01-02 -2.277498 -3.933674 -2.024719  2.0
2013-01-03 -5.836480 -5.604213 -4.130615  0.0
2013-01-04       NaN       NaN       NaN  NaN
2013-01-05 -5.697906 -5.742437 -5.142523 -1.0
2013-01-06 -7.665569 -7.996958 -6.630761 -3.0

In [17]:
# Applying functions to the data:

In [18]:
df.apply(np.cumsum)

                   A         B         C   D
2013-01-01  0.163832  0.000000  0.586754   5
2013-01-02  0.886334 -0.933674  1.562035  10
2013-01-03  0.049854 -1.537887  2.431420  15
2013-01-04 -1.091777 -0.799211  3.666131  20
2013-01-05 -0.789684 -0.541648  4.523609  25
2013-01-06 -0.455253 -0.538606  5.892847  30

In [19]:
df.apply(lambda x: x.max()-x.min())

A    1.864133
B    1.672351
C    0.782485
D    0.000000
dtype: float64

In [20]:
#Histogramming

In [21]:
s=pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [22]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [23]:
# 2.3.6 Merge

In [25]:
df= pd.DataFrame(np.random.randn(10,4))

In [26]:
df

          0         1         2         3
0  0.934223 -1.059530  0.196137 -0.334213
1  0.954498  0.167183 -0.124224  0.501763
2  0.871810  0.645851  0.701570 -0.407830
3 -0.530512 -0.353331  1.449184 -0.801918
4  0.603519  0.397802 -2.858980  0.347323
5  0.819937  0.209456 -0.508972 -0.556249
6 -0.011011 -0.327383  2.189414  1.629412
7  0.788484  0.667570 -0.401301 -0.419620
8 -0.635073  0.582239 -0.076280 -1.466266
9 -1.519761 -0.023936 -0.256505  0.033048

In [27]:
# break it into pieces

In [28]:
df[:3]

          0         1         2         3
0  0.934223 -1.059530  0.196137 -0.334213
1  0.954498  0.167183 -0.124224  0.501763
2  0.871810  0.645851  0.701570 -0.407830

In [29]:
df[3:7]

          0         1         2         3
3 -0.530512 -0.353331  1.449184 -0.801918
4  0.603519  0.397802 -2.858980  0.347323
5  0.819937  0.209456 -0.508972 -0.556249
6 -0.011011 -0.327383  2.189414  1.629412

In [30]:
df[7:]

          0         1         2         3
7  0.788484  0.667570 -0.401301 -0.419620
8 -0.635073  0.582239 -0.076280 -1.466266
9 -1.519761 -0.023936 -0.256505  0.033048

In [31]:
# combine the data set

In [35]:
peice =[df[:3],df[3:7],df[7:]]

In [36]:
pd.concat(peice)

          0         1         2         3
0  0.934223 -1.059530  0.196137 -0.334213
1  0.954498  0.167183 -0.124224  0.501763
2  0.871810  0.645851  0.701570 -0.407830
3 -0.530512 -0.353331  1.449184 -0.801918
4  0.603519  0.397802 -2.858980  0.347323
5  0.819937  0.209456 -0.508972 -0.556249
6 -0.011011 -0.327383  2.189414  1.629412
7  0.788484  0.667570 -0.401301 -0.419620
8 -0.635073  0.582239 -0.076280 -1.466266
9 -1.519761 -0.023936 -0.256505  0.033048

In [37]:
left = pd.DataFrame( 
                    
                    {'key':['foo','foo'],
                     
                     'lval':[1,2]
                    }
                   
                   )

In [39]:
right = pd.DataFrame( 
                    
                    {'key':['foo','foo'],
                     
                     'lval':[4,5]
                    }
                   
                   )

In [40]:
left

   key  lval
0  foo     4
1  foo     5

In [41]:
right

   key  lval
0  foo     4
1  foo     5

In [42]:
#merging of two data set

In [46]:
pd.merge(left,right,on='key')

   key  lval_x  lval_y
0  foo       4       4
1  foo       4       5
2  foo       5       4
3  foo       5       5

In [47]:
#2.3.7 Grouping

In [48]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
....: 'foo', 'bar', 'foo', 'foo'],
....: 'B': ['one', 'one', 'two', 'three',
....: 'two', 'two', 'one', 'three'],
....: 'C': np.random.randn(8),
....: 'D': np.random.randn(8)})

In [49]:
df

     A      B         C         D
0  foo    one  1.589857 -0.304040
1  bar    one -1.235835  1.197409
2  foo    two  1.536331  0.408491
3  bar  three -0.716335 -0.250451
4  foo    two  1.656748 -0.284867
5  bar    two -1.118261  0.514158
6  foo    one  2.237418 -0.445240
7  foo  three  0.807617 -0.087787

In [55]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -1.235835  1.197409
    three -0.716335 -0.250451
    two   -1.118261  0.514158
foo one    3.827276 -0.749280
    three  0.807617 -0.087787
    two    3.193079  0.123624

In [56]:
#2.3.8 Reshaping

In [57]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
....: 'foo', 'foo', 'qux', 'qux'],
....: ['one', 'two', 'one', 'two',
....: 'one', 'two', 'one', 'two']]))

In [58]:
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [61]:
index= pd.MultiIndex.from_tuples(tuples,names =['first', 'second'])

In [62]:
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [63]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

In [65]:
df2 = df[:4]

In [66]:
df2

                     A         B
first second
bar   one    -1.552393 -0.260895
      two    -0.590638  1.276561
baz   one     0.464663  0.374682
      two    -0.423299 -0.293957

In [73]:
stacked=df2.stack()

In [74]:
stacked.unstack()

                     A         B
first second
bar   one    -1.552393 -0.260895
      two    -0.590638  1.276561
baz   one     0.464663  0.374682
      two    -0.423299 -0.293957

In [75]:
stacked.unstack(0)

first          bar       baz
second
one    A -1.552393  0.464663
       B -0.260895  0.374682
two    A -0.590638 -0.423299
       B  1.276561 -0.293957

In [76]:
#Pivot tables

In [81]:
df = pd.DataFrame(
                    {
                        'A':['one', 'one', 'two', 'three']*3, #produce 12 lines 
                    
                        'B':['A','B','C']*4,
                    
                        'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                       
                        'D': np.random.randn(12),
                    
                        'E': np.random.randn(12)
                    }
                )

In [82]:
df

        A  B    C         D         E
0     one  A  foo  1.583288  1.376840
1     one  B  foo -1.897472  1.639068
2     two  C  foo  0.354503 -1.889648
3   three  A  bar -0.883839  1.201920
4     one  B  bar  0.069324 -0.104259
5     one  C  bar  0.147309 -0.444533
6     two  A  foo -0.235216 -1.735715
7   three  B  foo  1.385580 -1.283493
8     one  C  foo -0.242710 -0.569783
9     one  A  bar  0.655964 -1.233860
10    two  B  bar -0.183677 -0.791361
11  three  C  bar  0.837325  0.373505

In [85]:
pd.pivot_table(df,values='D',index=['A','B'],columns=['C'])

C             bar       foo
A     B
one   A  0.655964  1.583288
      B  0.069324 -1.897472
      C  0.147309 -0.242710
three A -0.883839       NaN
      B       NaN  1.385580
      C  0.837325       NaN
two   A       NaN -0.235216
      B -0.183677       NaN
      C       NaN  0.354503